import React from "react";
import "./Policy.css";

export default function Policy() {
  return (
    <div className="policy-container">
      <h1>תקנון אתר GardenGlow</h1>
      <p className="last-updated">עודכן לאחרונה בתאריך: 22.6.2025</p>

      <section>
        <h2>1. כללי</h2>
        <p>
          התקנון מנוסח בלשון זכר מטעמי נוחות בלבד, ומתייחס לכלל המגדרים.
          <br />
          האתר מופעל ומנוהל על ידי נעמה אליוביץ'
        </p>
      </section>

      <section>
        <h2>2. המוצרים והשירותים</h2>
        <p>
          המוצרים באתר כוללים: פרחים, עציצים, אגרטלים, שוקולדים, נרות, כרטיסי
          ברכה ועוד.
          <br />
          התמונות באתר להמחשה בלבד; ייתכנו שינויים קלים בין המוצרים בפועל לבין
          התמונות.
          <br />
          זמינות מוצרים תלויה במלאי, עונות השנה, ותנאים לוגיסטיים.
        </p>
      </section>

      <section>
        <h2>3. תהליך הרכישה</h2>
        <p>
          המחירים כוללים מע"מ אלא אם צוין אחרת.
          <br />
          התשלום יתבצע באמצעות כרטיס אשראי או שירות תשלום מאובטח.
          <br />
          העסקה תיקלט במערכת לאחר אישור מחברת האשראי וקבלת אישור סופי מהאתר.
        </p>
      </section>

      <section>
        <h2>4. משלוחים ואספקה</h2>
        <p>
          המשלוחים מתבצעים ברחבי הארץ בהתאם לתנאים ולזמינות.
          <br />
          זמן אספקה ממוצע: עד 3 ימי עסקים, בכפוף לכתובת הלקוח.
          <br />
          עיכובים שאינם בשליטתנו לא ייחשבו להפרת התחייבות ולא יקנו זכות לפיצוי.
        </p>
      </section>

      <section>
        <h2>5. ביטולים והחזרות</h2>
        <p>
          ביטול עסקה יתבצע תוך 14 יום מהקנייה, ובתנאי שהמוצר לא מתכלה או אישי
          (כגון פרחים).
          <br />
          החזר כספי יתבצע לאחר קיזוז דמי ביטול, כמקובל על פי חוק.
          <br />
          לא תתאפשר החזרת מוצרים שנפתחו, נפגעו או נעשה בהם שימוש.
        </p>
      </section>

      <section>
        <h2>6. פרטיות ואבטחת מידע</h2>
        <p>
          האתר פועל בהתאם לחוק הגנת הפרטיות.
          <br />
          המידע שיימסר על ידי הלקוח ישמש לצורכי טיפול בהזמנות, שיווק פנימי
          ושירות בלבד.
          <br />
          האתר עושה שימוש בטכנולוגיות הצפנה ואבטחת מידע מתקדמות.
        </p>
      </section>

      <section>
        <h2>7. שירות לקוחות</h2>
        <p>
          לפניות ניתן ליצור קשר באמצעות טופס באתר, בדוא״ל: GardenGlow@gmail.com
          או בטלפון: 0533135399.
          <br />
          שעות הפעילות: ימים א׳–ה׳ בין השעות 09:00–17:00.
        </p>
      </section>

      <section>
        <h2>8. סמכות שיפוט</h2>
        <p>
          הדין החל על האתר הינו דין מדינת ישראל בלבד.
          <br />
          כל מחלוקת תתברר בבתי המשפט בעיר תל אביב.
        </p>
      </section>
    </div>
  );
}
